Revit 2027 API
BuiltInFailures.LinkFailures.DeleteLinkSymbolPrompt Property
 All instances of Linked Model '[Name]' have been deleted, but the file itself is still loaded. Remove the Linked File using Manage Links dialog to save memory unless you are going to reuse it in this project. Removing the Link cannot be undone.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DeleteLinkSymbolPrompt { get; }
Public Shared ReadOnly Property DeleteLinkSymbolPrompt As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DeleteLinkSymbolPrompt {
	FailureDefinitionId^ get ();
}
static member DeleteLinkSymbolPrompt : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LinkFailures Class
Autodesk.Revit.DB Namespace